// Fill out your copyright notice in the Description page of Project Settings.


#include "Hook.h"
UHook::UHook() {


}
void UHook::Tick(float DeltaSeconds) {

}
void UHook::ActivateAbility()
{
    //  од активации способности
    // «десь можно добавить логику, специфичную дл€ этой способности

    // Ќапример, если это способность "ќгненный шар":
    // - —оздать огненный шар
    // - «адать ему начальную скорость и направление
    // - ѕрименить урон цел€м при столкновении

    // Ёто лишь пример, и конкретна€ реализаци€ будет зависеть от вашей игры и системы способностей
}